# taps
tap "nextdns/tap"
tap "puma/puma"

# command line tools
brew "awscli"
brew "coreutils"
brew "ctags"
brew "diff-so-fancy"
brew "direnv"
brew "fwup"
brew "gist"
brew "htop-osx"
brew "hub"
brew "hunspell"
brew "imagemagick"
brew "jq"
brew "ledger"
brew "m-cli"
brew "mosh"
brew "neovim"
brew "nextdns"
brew "packer"
brew "puma-dev"
brew "rcm"
brew "reattach-to-user-namespace"
brew "sqlite"
brew "terminal-notifier"
brew "terraform"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"

# languages managed via Homebrew
brew "go"
brew "lua"
brew "python@3.9"

# requirements for asdf plugins
brew "gpg"
brew "gawk"

# Mac App Store command-line interface
brew "mas"

## TODO: GitHub, GitUp, Google Drive, Itsycal, Messenger, MS Teams, Multipass,
# Setapp, Slack, Spotify, Transmission, VLC, Viscosity, Zoom

# Desktop app installs
cask "alfred"
cask "appcleaner"
cask "flux"
cask "google-chrome"
cask "kitty"

# QuickLook plugins
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"

# Fonts
tap "homebrew/cask-fonts"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"

# Mac App Store installs
mas "1Password", id: 1333542190
mas "Affinity Photo", id: 824183456
mas "Affinity Designer", id: 824171161
mas "Calca", id: 635758264
mas "Microsoft Word", id: 462054704
mas "Microsoft Excel", id: 462058435
mas "Pocket", id: 568494494
mas "Transmit", id: 403388562
mas "Tweetbot", id: 557168941
mas "The Unarchiver", id: 425424353
mas "Unsplash Wallpapers", id: 1284863847
