# taps
tap "nextdns/tap"
tap "puma/puma"
tap "hashicorp/tap"

# command line tools
brew "ansible"
brew "atuin"
brew "awscli"
brew "aws-amicleaner"
brew "bat"
brew "colima"
brew "coreutils"
brew "ctags"
brew "direnv"
brew "docker"
brew "dust"
brew "duf"
brew "eza"
brew "fd"
brew "fortune"
brew "fwup"
brew "fzf"
brew "gh"
brew "gist"
brew "git-delta"
brew "gnupg"
brew "gnu-units"
brew "htop-osx"
brew "hub"
brew "hunspell"
brew "imagemagick"
brew "ipcalc"
brew "jq"
brew "lazygit"
brew "ledger"
brew "m-cli"
brew "mosh"
brew "neovim"
brew "nextdns"
brew "oath-toolkit"
brew "opentofu"
brew "packer"
brew "pinentry-mac"
brew "pngpaste"
brew "puma-dev"
brew "rcm"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "starship"
brew "sqlite"
brew "terminal-notifier"
brew "terraform"
brew "terragrunt"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tree"
brew "typst"
brew "watch"
brew "wget"
brew "zk"
brew "zoxide"

# languages managed via Homebrew
brew "go"
brew "python"

# requirements for asdf plugins
brew "gpg"
brew "gawk"

# Mac App Store command-line interface
brew "mas"

# Desktop app installs
cask "1password"
cask "1password-cli"
cask "alt-c"
cask "appcleaner"
cask "brave-browser"
cask "git-credential-manager"
cask "google-chrome"
cask "google-drive"
cask "hammerspoon"
cask "keybase"
cask "kitty"
cask "prusaslicer"
cask "setapp"
cask "shortcat"
cask "slack"
cask "viscosity"
cask "vlc"

# Fonts
tap "homebrew/cask-fonts"
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-symbols-only-nerd-font"

# Mac App Store installs
mas "Affinity Photo", id: 824183456
mas "Affinity Designer", id: 824171161
mas "Transmit", id: 403388562
mas "The Unarchiver", id: 425424353
